app/controllers/tickets_controller.rb

SELECT * FROM "tickets"
---
  def index
    @tickets = Ticket.all

SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)
---
  def show
    @ticket = Ticket.find(params[:id])

SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)
---
  def edit
    @ticket = Ticket.find(params[:id])

INSERT INTO "tickets" ("name", "updated_at", "seat_id_seq", "price_paid", "phone", "address", "email_address", "created_at") VALUES('Nur Alya Rasyiqah', '2009-07-28 05:15:30', '001', 30.0, '015-33442', 'No 5, Jalan 5', 'alya@sayang.anakibu.com', '2009-07-28 05:15:30')
---
  def create
    @ticket = Ticket.new(params[:ticket])

    respond_to do |format|
      if @ticket.save

SELECT * FROM "tickets" WHERE ("tickets"."id" = 2)
UPDATE "tickets" SET "price_paid" = 80.0, "address" = 'Presint 11', "updated_at" = '2009-07-17 09:11:07' WHERE "id" = 2
---
  def update
    @ticket = Ticket.find(params[:id])

    respond_to do |format|
      if @ticket.update_attributes(params[:ticket])

SELECT * FROM "tickets" WHERE ("tickets"."id" = 4)
DELETE FROM "tickets" WHERE "id" = 4
---
  def destroy
    @ticket = Ticket.find(params[:id])
    @ticket.destroy